#include <stdio.h>
#include <windows.h>

void textcolor(int color_number)
{
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), color_number);
} //텍스트 색 설정

void main()
{
	system("mode con cols=200 lines=150");
	textcolor(11);

	printf("▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤\n");
	printf("                                                                                                                                                                          \n");
	printf("                                                                                                                                                                          \n");
	printf("                                                                               - 시간표 조회 -                                                                            \n");
	printf("                                                                                                                                                                          \n");
	printf("                                                                                                                                                                          \n");
	printf("                                                                  시간표를 조회할 강의실 번호를 입력해 주세요                                                             \n");
	printf("                                                                                                                                                                          \n");
	printf("                                                                                                                                                                          \n");
	printf("                                                                          +-----------------------+                                                                       \n");
	printf("                                                                          |          000          |                                                                       \n");
	printf("                                                                          +-----------------------+                                                                       \n");
	printf("                                                                                                                                                                          \n");
	printf("      +----------------------------------------------------------------------------------------------------------------------------------------------------------------+  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf("      |            월                         화                        수                         목                        금                        토              |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf("  0A  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf("  0B  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf("  1A  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf("  1B  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf("  2A  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf("  2B  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf("  3A  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf("  3B  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |																																								   |  \n");
	printf("  4A  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf("  4B  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf("  5A  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf("  5B  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf("  6A  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf("  6B  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf("  7A  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf("  7B  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf("  8A  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf("  8B  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf("  9A  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf("  9B  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf(" 10A  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf(" 10B  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf(" 11A  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf(" 11B  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf(" 12A  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf(" 12B  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf(" 13A  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf(" 13B  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf(" 14A  |  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요   강의명을여기입력해주세요  강의명을여기입력해주세요  강의명을여기입력해주세요  |  \n");
	printf("      |                                                                                                                                                                |  \n");
	printf("      +----------------------------------------------------------------------------------------------------------------------------------------------------------------+  \n");
	printf("                                                                                                                                                                          \n");
	printf("                                                                                                                                                                          \n");
	printf(" KNU                                                                                                                                                                      \n");
	printf("▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤▤\n");
}